Revit 2027 API
ExportDWGSettings.GetActivePredefinedSettings Method
 Returns the active pre-defined non-in-session exporting settings for DWG in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportDWGSettings GetActivePredefinedSettings(
	Document aDoc
)
Public Shared Function GetActivePredefinedSettings (
	aDoc As Document
) As ExportDWGSettings
public:
static ExportDWGSettings^ GetActivePredefinedSettings(
	Document^ aDoc
)
static member GetActivePredefinedSettings :
        aDoc : Document -> ExportDWGSettings
Parameters
aDoc Document
 A Revit document to retrieve the active pre-defined exporting settings for DWG.
Return Value
ExportDWGSettings
 The active pre-defined exporting settings for DWG, or null if nothing pre-defined exists or the in-session settings is selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDWGSettings Class
Autodesk.Revit.DB Namespace